{
  "format": "SGO",
  "endian": "LE",
  "version": 258,
  "variables": [
    {
      "name": "table",
      "type": "ptr",
      "value": [
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Reconvene"},
            {
              "type": "string",
              "value": "Emergency dispatch request. We have reports of “huge bug” sightings. Probably a prank after so many years, but I want you to check the location."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Spreading Disaster"},
            {
              "type": "string",
              "value": "Dispatch request from the civilians. A huge monster has appeared in the city. Be careful, it spits a powerful acid that can cause serious damage. Head out there and good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Winged War Goddess"},
            {
              "type": "string",
              "value": "A gigantic alien creature has appeared in the residential area. You must protect the civilians!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Setting Sun"},
            {
              "type": "string",
              "value": "We've lost communication with the Wing Diver team. Head to their last location and support the Wing Divers."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Wind Break"},
            {
              "type": "string",
              "value": "Emergency support request. The Wing Diver team is engaged with a very strong enemy and is taking heavy casualties. Their engagement location is not far from here. You are to head out immediately, destroy the monsters and rescue the surviving Wing Divers."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Underground Cave"},
            {
              "type": "string",
              "value": "A giant bug nest has spread out under the city. We cannot allow it to remain intact! We will now start to infiltrate their burrows. Move out immediately and report to the local Ranger team for further instructions."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Eruption"},
            {
              "type": "string",
              "value": "Emergency support request. Giant spiders have emerged from underground. They've invaded the city and are attacking citizens. These are a formidable enemy and there are a great many of them. The Air Raiders are taking point. Air Raiders, move out!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Retaliation"},
            {
              "type": "string",
              "value": "Ranger team is fighting a gigantic creature in the residential area. Head out and support."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Beach Fear"},
            {
              "type": "string",
              "value": "Dispatch request to the port area. A Retiarius has been spotted. You're to go investigate."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Return"},
            {
              "type": "string",
              "value": "Destroy the giant creature in the city! A Ravager mothership is approaching the area and will be engaged by our Air Force. Ground troops, focus on the creature."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Air Force"},
            {
              "type": "string",
              "value": "The mothership is launching flying drones. These drones are automatic weapons that appear to be targeting people. They are terrifying slaughter machines which never tire. They must be stopped before they eliminate all the citizens!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Day of the Demons"},
            {
              "type": "string",
              "value": "Ravager transport ships are flying over the city. They must intend to drop more aliens on the population. Head out and protect the civilians from attack."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Takedown"},
            {
              "type": "string",
              "value": "The enemy transport ships are continuing their drops and causing more damage. Our aircraft haven't made a dent due to the transport ship's thick armor. But intel may have a solution. We must attack when they make their drops, through the open hatch and destroy it from the inside. The hatch is only accessible from the ground, so it's up to you. Equip with long-range weapons and move out."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Preventing Landfall"},
            {
              "type": "string",
              "value": "We have confirmation that the mothership is travelling offshore. The mothership has dropped several Hectors, a walking battle troop, and they are attempting to make landfall. We'll set up a shore defense and coordinate with aerial troops for support from the air."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Land Collapse"},
            {
              "type": "string",
              "value": "The aliens are digging tunnels to move under the city. A tunnel entrance has been confirmed in the city. Alien monsters have been emerging from it and soon the city will be overrun! We need to destroy the tunnel entrance and stop any more of those filthy creatures from emerging. You are to go to the location."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Fortress Siege"},
            {
              "type": "string",
              "value": "The Ravagers have begun a serious offensive. They've begun simultaneous attacks in several areas, and they're using a giant walking fortress, 200 meters long. It is formidable, with weapons bristling on its gigantic frame. The attack aircraft Midnight has been dispatched to destroy it. We are to attack the fortress' legs, and then defeat any remaining enemy forces. Ground forces, head out!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Valley Shadows"},
            {
              "type": "string",
              "value": "We have confirmed sighting of a flying enemy transport ship. We will deploy in the mountain region where you'll rendezvous with Ranger team. Make sure to equip long range weapons to attack the transport ships."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Artillery"},
            {
              "type": "string",
              "value": "Hector troop variants, probably long-range support models, have started a ferocious assault. They're armed with plasma cannons. We have to stop the Hectors making landfall and destroy them. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Breaking Through"},
            {
              "type": "string",
              "value": "New walking-machine variants have reached the city. They continue to march unharmed despite multiple airstrikes. These machines have some sort of energy screen that blocks attacks. If we don't find a way to destroy their screens, we won't stand a chance. Ground troops are to attack the defensive screens and find a way to destroy the machines."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Shining Stronghold"},
            {
              "type": "string",
              "value": "The Ravager transport ships have dropped something in the mountains. Intel has confirmed that it is a defensive screen. We are dispatching Fencers to the location. The Storm Team will provide support."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Into the Depths"},
            {
              "type": "string",
              "value": "The giant bugs just keep coming. Things will only worsen as long as they have their nest. We need to strike them where they live. We will infiltrate the nest from the same point as last time, following the same route. When we are as deep as we can go, we will attack. We've no idea what to expect, so be careful."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "A Trap"},
            {
              "type": "string",
              "value": "The infiltration was a success. We were greatly outnumbered, so our casualties were high. The enemy is on familiar ground, which gives 'em the edge. Expect an attack the moment you step inside the nest. Try to use the terrain to your advantage."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Giant Robots"},
            {
              "type": "string",
              "value": "The Ravager's combat troops, the Hectors, have invaded the city. They are currently engaged by Ranger team. However, Hector reinforcements have arrived and are flanking Ranger team. Head out immediately and support the Ranger team."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Anchored"},
            {
              "type": "string",
              "value": "The Ravager troops that attacked our defenses were under the mothership's command. Therefore, taking down the mothership would strike a mighty blow. Currently the mothership is anchored at the coast with a group of transport ships. Approach from the ground and attack all ships in the area."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Silver City"},
            {
              "type": "string",
              "value": "We have confirmed underground tunnel entrances in the city. Giant organisms are coming from them...but there is a Retiarius in the area. It has made a web and is waiting for attackers. It will be difficult but we must destroy the tunnel entrance to save the citizens."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Crimson"},
            {
              "type": "string",
              "value": "We have confirmed a large number of giant aliens and we're leading them to an uninhabited part of the coast to contain the damage. Fencers will deploy to block the enemy and our snipers, already in place, will use that chance to exterminate them all. We want Storm Team to support."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "High-speed"},
            {
              "type": "string",
              "value": "High capacity flying drones called “Reds” have invaded the city. They seem further enhanced since our last encounter. Direct the three snipers stationed in the area and destroy the enemy."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Brute Force"},
            {
              "type": "string",
              "value": "The Rangers are consolidating their forces. It is the first time a large enemy has gathered. We cannot even count the number of Hectors. However, this is good for us. We are ready. We will attack them straight on and crush them. The battle will be on the plains. But we will also attack from the air. The troops will fan out from zone 1 to 5. Storm Team will fight in zone 2. This is Operation Brute Force."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Charge Phase 1"},
            {
              "type": "string",
              "value": "We succeeded in dealing a massive blow to the Ravagers. We must destroy the nests and exterminate the enemy before they can regroup. You enter the nests and find their queen. This will be a large-scale infiltration of their tunnels. The first phase will look for a route to the depths of the tunnels and secure it for troops to follow."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Charge Phase 2"},
            {
              "type": "string",
              "value": "We have successfully infiltrated the nests. However, the deeper we go, the more intense the attacks. We have lost contact with almost half of our troops. The enemy has started acting in groups to flush out our troops and using traps to defeat our forces.  Each squad needs to be careful and eliminate any enemy close to them."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Charge Phase 3"},
            {
              "type": "string",
              "value": "We have arrived at the deepest part of the nest, so we enter the final stages of this operation. However, we have lost over half of our troops. The queen is somewhere in this area, surrounded by her minions. Storm Team is to link up with the Ranger team which is fighting to consolidate our strength and look for the queen."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Thunder"},
            {
              "type": "string",
              "value": "A enemy mothership has invaded the city. She is formidable, but if we can shoot it down, the Ravagers will be dealt a great blow. The hopes of our allies across the world lie with this strategy and they have offered their support. The entire world has been attacked by the alien mothership fleet. We must destroy the mothership, but we'll have to deal with her escort. Focus on their defense squads first, then we can take down the mothership."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Infiltration"},
            {
              "type": "string",
              "value": "The Retiarius have invaded the buildings. The Wing Divers launched an attack, but were forced to retreat. There are underground tunnels in the area and spider-like aliens have emerged from them. Nearby squads are hurrying to help. Support the Wing Divers."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Convergence"},
            {
              "type": "string",
              "value": "Ravager transport ships are converging at the port. According to reports, there is a force of a scope unseen before. It is a sure sign that an all-out attack is imminent. We won't sit back and wait. We'll attack before they've gathered. This will be an extremely dangerous mission. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Inferno"},
            {
              "type": "string",
              "value": "The intensity of the Ravagers' invasions keeps increasing. We are being overwhelmed. This battle will be the most difficult by far. The Ranger team has lost their commander from an enemy attack and are now in chaos. It's only a matter of time before they are destroyed. Go and offer them support immediately. Good luck Storm Team."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Starship"},
            {
              "type": "string",
              "value": "Preparations for a coordinated global attack on the alien motherships are almost complete. The enemy's ships are  powerful fortresses with massive firepower. There is no guarantee of victory and we'll all need to exercise caution. We will take the lead. We must shoot down the mothership. If we are successful, we will be praised throughout history. Now go and fight for all humanity!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Dense"},
            {
              "type": "string",
              "value": "The alien mothership has been defeated. The coordinated attack resulted with two motherships defeated. The Ravagers will be in shock after this turn of events. However...since then the giant bugs have gone to nest and are multiplying. A tunnel entrance has been discovered at the port area. Although we have beaten back the Ravagers, we cannot rest until these evil spawn are destroyed. We will destroy the underground tunnels."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Crossing"},
            {
              "type": "string",
              "value": "We have confirmed large enemy numbers emerging from tunnels in the mountain area. We must destroy them before they strike out. There appear to be three tunnel entrances. You can reach them by crossing the bridge from the mission start point. Be aware that Ravager combat troops are supporting the creatures. Before the bridge is sealed off, cross the valley and destroy the tunnel entrances."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Search"},
            {
              "type": "string",
              "value": "The clean up operation will begin. Engage all enemies in the city. The expected arrival of a team has been delayed, so we will have to continue the attack with the Ranger team and Storm teams only."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Waterside Bugs"},
            {
              "type": "string",
              "value": "Huge alien creatures have been confirmed along the river that runs through the city. They seem to have made several entrances to their tunnels by the river. You must hurry to the area and destroy the tunnels. Flying types have also been spotted in the area. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Annihilation"},
            {
              "type": "string",
              "value": "Attack the enemy transports seen in the mountain area."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Natural Calamity"},
            {
              "type": "string",
              "value": "Engage the Ravagers' flying drones that have entered the city."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Steel Beast"},
            {
              "type": "string",
              "value": "Earth Eaters have appeared over the city. Go and engage!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Void Ship"},
            {
              "type": "string",
              "value": "We have confirmed a new Ravager transport ship. Compared to the previous ships, this one is many times bigger. It can also hold a great deal of giant monsters. You are to proceed and engage immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Blue Fighters"},
            {
              "type": "string",
              "value": "A large Ravager transport ship is over the city, and is dropping Hectors. The report says that this is the same new type as that seen in Europe yesterday. The troops sent were defeated. It is protected by an electromagnetic shield, so it is not easy to defeat. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Earth Defenders"},
            {
              "type": "string",
              "value": "We have confirmed that the aliens are continuing to move. We'll mobilize and engage them in the mountains. The Ravagers have dropped Shield Bearers who are moving to defend the giant insects. That will make the insects very dangerous. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Mountain Pass Trap"},
            {
              "type": "string",
              "value": "We are attacking the insects gathered in the mountains. An attack squad was sent, but they were forced back with casualties. The Retiarius forms the hub of the enemy army making advance difficult. We'll send Air Forces, a cannon squad and transport units. The Air Raiders will coordinate with the support squads. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Fortress Frenzy"},
            {
              "type": "string",
              "value": "A new walking fortress attacked the city by surprise, with many citizens unable to evacuate, many were lost. We'll engage and give citizens time to escape...only ground troops stand between the fortress and the population's lives since our Air Forces are heavily depleted. This will be a decisive battle. We must destroy the four-legged walking fortress. Help buy some time."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Pincer"},
            {
              "type": "string",
              "value": "Emergency report! A Hector squad has approached and there is a another to the rear! Hide in the valley! If you have to fight the Hectors with their shields equipped, attack areas not covered by their shields, like their left arms."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Ravages of War"},
            {
              "type": "string",
              "value": "Since the flying models appeared, the giant insects have been more active, they've dug tunnels under the city and built more entrances. We've an emergency report from the city. They've confirmed the presence of a tunnel entrance. Go investigate."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Air Mobilization"},
            {
              "type": "string",
              "value": "Ravager aerial squads are over the city, mostly flying drones, but several Reds confirmed. We will meet them with an attack. Deploy with anti-aircraft equipment."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Bug Invasion"},
            {
              "type": "string",
              "value": "We have confirmed spider-type giant insects. A Wing Diver squad is already in battle but they're heavily outnumbered. The Wing Divers will be wiped out at this rate. Head to the location on a rescue mission."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Transport Ship Surprise Attack"},
            {
              "type": "string",
              "value": "A large enemy transport is at the coast dropping giant insects. The transports are protected by numerous defense squads so a simple attack is not possible. Air Forces, cannons and transport units will deploy. The ground troops and Air Raiders will defeat these large transports. Air Raiders will maintain contact with the support squads. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Bug King"},
            {
              "type": "string",
              "value": "The spider-type insects have infiltrated the city. It has created panic amongst the residents. Deploy and assist."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Crazy Skies"},
            {
              "type": "string",
              "value": "The Earth Eaters are spreading across the globe, leaving charred cities in their wake. The damage is incalculable. We must face the fact that they will soon cover the world. Our civilization is on the brink...we must defeat these Earth Eaters. The battle has already started in many locations. We will attack the Earth Eaters in our area and wipe them out. Ground troops should attack the turrets and damage the Earth Eaters. Godspeed to all."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Fleet Below"},
            {
              "type": "string",
              "value": "Ravager transport ships in the mountain are making giant insect drops. The insects are heading for the city. If this problem is not solved, they will spread their terror far and wide. We will engage them straight away."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Bad Premonition"},
            {
              "type": "string",
              "value": "The transport ships we shot managed to drop a large amount of insects, which are now in the city. We'll head to the city and conduct a search and destroy operation. If we eliminate the giant insects, the mission will be complete."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "City of Horror"},
            {
              "type": "string",
              "value": "A group of dragons is attacking the civilians. Deploy to the location on a rescue mission. The dragons have massive combat capability, far beyond that of the giant insects we've encountered. It is a formidable enemy but we'll not be deterred. Prepare to deploy!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Mountains Ablaze"},
            {
              "type": "string",
              "value": "Ravager combat machines have been confirmed in the mountains and are protecting the dragon teams. We cannot allow their numbers to increase anymore. The enemy are concentrating their attacks on our base. The EDF has lost the majority of its force and we've lost contact with our squads. We are isolated and can't hope for support. We'll have to attack with only our ground troops."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Breaking Through"},
            {
              "type": "string",
              "value": "A large number of Retiarius have surrounded the city with a web and it is becoming their nest. We have sent an assault squad to rescue the civilians who could not evacuate. I want Storm Team to support the assault team."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Bug Tower"},
            {
              "type": "string",
              "value": "This is surprising info. We've confirmed a large number of enemies in the mountains with a kind of flying nest. Head out and investigate."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Fortress Attack"},
            {
              "type": "string",
              "value": "We failed to destroy the walking fortress, so now we will attempt to change its route. It is currently nearing our defense area. This walking fortress is enhanced and its armor is too much even for our Grind Buster. We'll have to attack its weak point, which can only be done with ground troops. If we fail, the city will be destroyed. Also, the walking fortress has enhanced Hectors with particle stream cannons. Move out and good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Mountain Liberation"},
            {
              "type": "string",
              "value": "Giant insects are gathering in the mountains, over a wide area. A disturbing amount of them. We'll engage immediately. Dragon-types are also confirmed. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Sniper Attack"},
            {
              "type": "string",
              "value": "Large transport ships are dropping drones. The Wing Divers aren't very effective against flying enemies. We'll destroy these giant transport ships from above. Storm Team should equip sniper rifles to destroy the transports. Deploy to the top of the buildings, and a defense squad will cover you. Don't leave your station, even if you encounter resistance. If you are successful, we will drop a Wing Diver team. They will kill any remaining giant insects."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Towering Beast"},
            {
              "type": "string",
              "value": "The Ravager's combat squads have invaded the city. They appear to be mixed squads of Deroys and Hectors. Go with the Ranger team and engage...We've just received new intelligence. It's an enhanced model of the Deroy, with longer legs and it is equipped with multiple laser cannons. First attack the legs, and then destroy the lasers."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Teeth of the Universe"},
            {
              "type": "string",
              "value": "A large transport ship has been confirmed and is dropping dragons. The Ravagers have the power to manipulate even these dragon-types. We have to act fast. This will be a dangerous mission, but I would like you to act immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Giant Ship"},
            {
              "type": "string",
              "value": "The Ravager's giant battleship is approaching the city. We must intercept it before it can cause countless damage. We will meet them with an attack."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Spearhead"},
            {
              "type": "string",
              "value": "We have destroyed half of the giant insects that have collected in the mountains. However, intel reports that the Ravagers have dropped Shield Bearers. There is a shield screen protecting the giant insects. We will go to the mountains again and destroy the giant insects once and for all."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Tower Siege"},
            {
              "type": "string",
              "value": "The damage from the flying giant insects is spreading. According to reports, the flying insects are coming from the nests in the mountains. We need to make a stand. Move out and completely destroy the nests."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Den of Thieves"},
            {
              "type": "string",
              "value": "The results were not as we anticipated. The tower is only part of the nest, the rest extends underground, so we must attack there too. The tower will be rebuilt and our chance to entirely destroy their nest will no longer be possible. This is our only chance. We will start our infiltration underground."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Death Queen"},
            {
              "type": "string",
              "value": "We have arrived in the depths of the nest. The queen is somewhere in this area and may have evolved becoming even stronger. Intel has named her, Death Queen. Now that we're close it's time to make our attack. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Machine Squad"},
            {
              "type": "string",
              "value": "The large enemy transport ships are approaching from the coast and must plan to drop Deroys onto land. We must defeat them here. The only targets are the Deroys. Don't engage the large transport ships. The Deroys are too big now and their transport has become difficult. The ships seem to only be dropping smaller versions. However, even though they are small, they have multiple lasers on their legs. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Monster Party"},
            {
              "type": "string",
              "value": "The dragon swarm is approaching. I shudder at the numbers. We sent fighters to meet them, but they were wiped out in seconds... The dragons are approaching...\nWe're the only ones who can defend the city."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Labyrinth of Light"},
            {
              "type": "string",
              "value": "A large transport ship has arrived at the port. We attempted an attack, but the ship has seven shield screen generators to create a strong defense. We need to get past the shield screen and attack the large transport ship. The enemy's defense is an iron wall. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "City Flaws"},
            {
              "type": "string",
              "value": "Intercept a large group of giant insects that have infiltrated the city. Our scout's have confirmed the presence of flying insects in the group. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Monster Camp"},
            {
              "type": "string",
              "value": "It has been confirmed that there are multiple giant insects in the mountains. We must destroy them before they approach the city. Deploy and engage immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Fallen Flagship"},
            {
              "type": "string",
              "value": "The Brain has been found. However, the attack from our aerial troops was intercepted by Earth Eaters. It's now up to you. There are escorts around the area of the Brain in anticipation of attacks. Destroy them and the Brain. Its weak point is its head. Use long-range weapons that can target the top. The future of mankind depends on the success of this mission."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Heaven's Army"},
            {
              "type": "string",
              "value": "There are three large transport ships coming towards the city. No sign of any other enemies they may be undefended."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Encircling"},
            {
              "type": "string",
              "value": "There are enemy transport ships over the city. The Air Force was unable to stop them. They're dropping giant insects. We're being overrun. Perhaps they feel they have won the fight and are starting to clear up the final dregs? But we won't standby on the day of our destruction. All those who can fight head out and engage! Attack the transport ships from the ground."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Divine"},
            {
              "type": "string",
              "value": "A group of dragons has arrived at the city. We lost contact with the squad that engaged them. Engage the dragons."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Threat"},
            {
              "type": "string",
              "value": "Ranger 7 has encountered a large group of giant insects. They've been forced to retreat and are now surrounded with more bugs arriving. Head out and support the team."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Battle to the Death"},
            {
              "type": "string",
              "value": "The Ravager's fleet is approaching from the sea and must not be allowed to reach the city. Ground forces will be deployed along the coast and keep them from making landfall. Head out immediately...\nThis will be a decisive battle. Good luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Massive Mobilization"},
            {
              "type": "string",
              "value": "The Ravagers have started mobilizing an army. It is most likely a prelude to a massive attack. We're depleted. We can't defend against an all out attack. Though there may be a way...a surprise attack before the enemy finish their preparations. Our very survival hangs in the balance... You can join in the battle if you wish. This is a volunteer mission."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Scorching"},
            {
              "type": "string",
              "value": "Those of us who have managed to survive have continued the battle. However, the final moment is almost here. The enemy's army will soon be upon us. We're outnumbered, almost everything is destroyed and we've little hope. But we will fight! Join us if you wish to die with honor!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Star Eaters"},
            {
              "type": "string",
              "value": "EDF groups across the globe have perished. The only remaining force is on the aircraft carrier Despina. Without support and no supplies, we do not have the power to continue the fight. If we be dead tomorrow, today we make our stand. We will attack the Earth Eaters. The last threads of humanity depend on this. The difference in our fighting capacities is dramatic. Though the outcome may be obvious, we will not give up. Prepare for battle you brave EDF soldiers. For all you've done and will do now... I thank you."
            }
          ]
        }
      ]
    }
  ]
}