{
  "format": "SGO",
  "endian": "LE",
  "version": 258,
  "variables": [
    {
      "name": "table",
      "type": "ptr",
      "value": [
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Crisis at Base 228"},
            {
              "type": "string",
              "value": "Thanks for the help, civilian.\nIt'll be safe once we're back on solid ground.\n\nWe have to rendezvous with the troops and deal with things on our end now, so this is where we say goodbye."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Monster Attack"},
            {
              "type": "string",
              "value": "We have arrived in town.\nWe're safe now.\nAt least, we should be."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Brink of Destruction"},
            {
              "type": "string",
              "value": "Monsters are everywhere.\nCould it be because of that tower?\n...Damn it!\nIf only we had come sooner."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Crumbling City"},
            {
              "type": "string",
              "value": "This city is safe. Let's hurry.\n...?!\nThere's a monster in town!\n\nWe can't let it get away. Let's go."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Spawn Site"},
            {
              "type": "string",
              "value": "We've come this far, we should be fine.\nLet's go. We're safe now."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Unmanned Bombers"},
            {
              "type": "string",
              "value": "Enemy ships have deployed drones. Quite a few of them, too.\nOffensive teams currently en route... but a new drone model specialized in ground attacks has been identified, so we're bracing for a tough fight. Requesting for immediate backup."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Messenger of Disaster"},
            {
              "type": "string",
              "value": "Alien infantry is continuing to advance. The main body has been split into a handful of teams, controlling a large area.\nEnemy infantry are approaching this area, as well. An offensive team has been deployed. Please cover us."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "α Colony Swarm"},
            {
              "type": "string",
              "value": "A number of monster sightings have been reported in the city center. Please proceed to the location."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Airborne Invaders"},
            {
              "type": "string",
              "value": "This is an emergency.\nFlying monsters are in the vicinity.\nThey cleared our defensive line with ease and have infiltrated the city center. Evacuation support will not arrive in time, leaving the civilians defenseless.\n\nThere's no time to lose. Teams deployed in the vicinity are to report to the area immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Giant Monster Ball"},
            {
              "type": "string",
              "value": "A Gamma-type monster has infiltrated the city center.\nRendezvous with your team and prepare to eliminate the threat."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "β Colony Rush"},
            {
              "type": "string",
              "value": "Monsters are multiplying everywhere and must be dealt with ASAP.\n\nOur mission is to exterminate the Beta-type overrunning the city. Teams are few... so good luck out there."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "City Destruction"},
            {
              "type": "string",
              "value": "Defense line has been crushed by a huge Gamma-type. Powered exoskeletons wiped out. The Gamma-type destroys buildings and vehicles, so conventional tactics will not work.\n\nIt has now infiltrated the city. Forces in the vicinity are to report to the area."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Paratroopers"},
            {
              "type": "string",
              "value": "Enemy ships have arrived, dropping alien paratroopers on the city.\nCivilians have not been evacuated in time. Forces in the vicinity are to report ASAP to the area and eliminate the enemy paratroopers."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Operation Mountain Survey"},
            {
              "type": "string",
              "value": "These mountains are full of monsters.\nThere must be a large breeding ground somewhere nearby....\nBut this fight won't be an easy one.\nLet's fall back for now and get into position."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Dark Strategy"},
            {
              "type": "string",
              "value": "Alien construction team spotted.\nLooks like they're bringing something into the cave.\n\nThe aliens have already withdrawn, but... further investigation is required.\nInfiltrate the cave and figure out what the aliens are hiding."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Contaminated Zone Part I"},
            {
              "type": "string",
              "value": "A large breeding site has been discovered. It seems that abandoned urban areas are becoming monster nests.\nQuite a few monsters have already hatched and have begun to migrate to the surrounding areas.\n\nForces in the vicinity are to report to the site immediately. We must exterminate the monsters in the surrounding areas and clear the way to the breeding ground."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Contaminated Zone Part II"},
            {
              "type": "string",
              "value": "Upon arrival at the breeding ground, units are to begin extermination efforts immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Code N"},
            {
              "type": "string",
              "value": "A monster, now of all times?!\n\nThose who can still fight, go up to the surface.\nKeep the monster away from the base.\n\nHurry, prepare to open fire!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Conflagration"},
            {
              "type": "string",
              "value": "This is a rescue request.\nAn extermination team has discovered a monster breeding site.\nAttempts to destroy the eggs were made, but now the monster is fighting back. The situation is looking dire.\n\nPlease proceed at once to the location.\nRemain vigilant, as the breeding site appears to be quite large."
            }
          ]
        }
      ]
    }
  ]
}