{
  "format": "SGO",
  "endian": "LE",
  "version": 258,
  "variables": [
    {
      "name": "table",
      "type": "ptr",
      "value": [
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Base 251 †††††"},
            {
              "type": "string",
              "value": "Request for reinforcements from Base 251. Head in their direction immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Enemy Invaders"},
            {
              "type": "string",
              "value": "Time to crack down on some enemy invaders. Don't worry, it's a simple job."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Standard Mission"},
            {
              "type": "string",
              "value": "We're cracking down on enemy invaders. We're keeping the town safe because that's our job."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Top Priority Extermination Order"},
            {
              "type": "string",
              "value": "Today's job is exterminating monsters. You keep the civilians safe. There’s no days off for this job, got it?"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Unchanging Days"},
            {
              "type": "string",
              "value": "Good news, you've got a mission. You'll be taking care of some monster eggs. It's hard labor, but it's an important job. Work as long as you're alive."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Assist the Extermination Team"},
            {
              "type": "string",
              "value": "Good news, you've got an easy job today. Go help out the extermination team."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Hive Cleanup Mission"},
            {
              "type": "string",
              "value": "The nest has to be somewhere around here. Do those monsters really think they can live in our town? Time to send them sky high.\n\nDon't worry, you'll be accompanied by gun wagons. No flying enemies either."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Fanged Monsters"},
            {
              "type": "string",
              "value": "Extermination team to the west is going after some red monsters. You'd better give them a hand.\n\nThese red beasts use their fangs to hunt prey, but don't give up even if they do sink their teeth into you. Just blast away."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Visitors"},
            {
              "type": "string",
              "value": "Sounds like we've got invaders. It's time to crack down on them. You'll be patrolling the town while you're at it. I don't care how many times you've done this already. Don't get sloppy."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Next Day"},
            {
              "type": "string",
              "value": "Time to crack down on some invaders. Same enemies as always. No sweat."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Machine Men"},
            {
              "type": "string",
              "value": "Sounds like invaders have taken over the city. Let's chase them out. Who the hell do they think they are? Time to show them who's boss."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Colossal Machines"},
            {
              "type": "string",
              "value": "Some super-sized invaders have showed up. Their bodies are just as big as their attitudes. You can't let your guard down against them. Don't worry, though. You'll have veterans with you today. You'll find a way."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Big Day †††††"},
            {
              "type": "string",
              "value": "Does this ring-shaped ship just plan to sit in the air doing nothing, completely defenseless? They must think they've already won. Humanity's on the verge of destruction. They're sitting back now, thinking we don't have the strength left for a counterattack, but that's going to be their fatal mistake. Time to bloody their nose. Get close to the ring-shaped spacecraft and take it down.\n\nDon't forget to bring long-range weapons. You'll need them."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Turning Point"},
            {
              "type": "string",
              "value": "Congratulations on making it in.\n\nFive months have already passed since the aliens first appeared. Though we've put up a good fight, we've been forced into a difficult situation now. So long as we don't have a way to destroy that massive disc, we just have to find a way to survive.\n\nThis giant saucer keeps sending monsters down like they own the place, and we just keep getting whittled down. It's only a matter of time before our forces are exhausted at this rate. That said, all we can do is exterminate them. If only we had a way to shatter that disc..."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Extermination"},
            {
              "type": "string",
              "value": "Monsters have appeared in the city. This is a sudden attack, and the civilians have yet to be fully evacuated. Get over there at once to assist the teams in combat. A giant saucer hasn't been spotted, so we don't know how these monsters got there. Be on high alert."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Beta Spread"},
            {
              "type": "string",
              "value": "Teleportation Ships have flown to the city, where they're dropping monsters. You need to head there right away. Your goal is to keep the civilians safe. Monster extermination is your top priority. We'll leave the Teleportation Ship to the air force."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Drone Invasion"},
            {
              "type": "string",
              "value": "The Mothership is dropping drones as it moves. These drones are terrifying machines that indiscriminately attack humans. Units have been deployed along the Mothership's path, where they'll wipe out any drones before the damage can spread. You need to head there right away."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Crash the Ship"},
            {
              "type": "string",
              "value": "We're now beginning the attack on the Mothership. This craft is now stopped above the city. We believe that it's maintaining such a low altitude in order to drop monsters.\n\nThe damage will only continue to spread if we don't act. We can't wait for the air force to attack. Ground units, approach the Mothership. Wipe out any monsters and drones you find, then attack the Mothership."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Operation K6"},
            {
              "type": "string",
              "value": "A new extraterrestrial lifeform has been detected. It's even larger than both Alphas and Betas. Total length, approximately seventy meters. It may be the largest living creature ever seen by man. Given the many biological differences from the Alphas and Betas, a special designation has been deemed appropriate, and thus its new name, Erginus. We're sending in the recently finished EMC unit to conduct an attack operation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Melee at the Pier"},
            {
              "type": "string",
              "value": "Damned monsters. They'll follow us to the end of the world.\n\nWe've got our backs to the sea. There's nowhere left to run. We fight them off here."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Silver Fleet"},
            {
              "type": "string",
              "value": "New enemy ships are flying over Europe. They're even larger than the Teleportation Ships, and they keep growing in number. The fleet is starting to grow massive.\n\nWe expect cities to be attacked. Answer the request for assistance and help defend the area."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Third Machine"},
            {
              "type": "string",
              "value": "New enemy ships have flown above the city and dropped unidentified drones. They must be destroyed before the damage can spread. Work with the anti-material rifle team and head to the field."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Arrival of the Dropships"},
            {
              "type": "string",
              "value": "Alien dropships are now approaching the city. All units near their estimated path, move to the specified location immediately. There are still many civilians left in town. Engage any dropped aliens as they're spotted while you help the residents evacuate."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Tower of Light"},
            {
              "type": "string",
              "value": "New enemy ships are passing overhead. Get ready on the ground for any dropped Androids."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Sniper Unit"},
            {
              "type": "string",
              "value": "The presence of a Beta invaders horde led by aliens is confirmed. Although located in an evacuated area, they're only a few kilometers away from the city. They need to be wiped out here. Sniper team has been dispatched. The plan is to take them down with long-range rifle fire. Rendezvous with the sniper team and provide assistance."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Drifters"},
            {
              "type": "string",
              "value": "Type 3 Drones have entered the city. While we just barely managed to evacuate the civilians in time, these drones now have control over the area. A Fencer team has been sent to the area. Provide them with cover and retake the city."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Red Machines"},
            {
              "type": "string",
              "value": "Destroy the drones that have flown into the city. Head to the indicated location with anti-air equipment in tow. Just note that red units have been detected among the drones. While we're uncertain of how these might differ in function, you need to be on high alert."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Death Race"},
            {
              "type": "string",
              "value": "A new type of enemy spacecraft has appeared above the city. Ground units, prepare for Androids to be dropped. Two infantry teams, Delta and Charlie, are already on the move. If there's an emergency, rendezvous with the other teams and adapt to the situation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Grenadiers"},
            {
              "type": "string",
              "value": "The dropped Android Grenadiers have stopped inside the city. You need to eliminate them before they begin acting. Unfortunately, the air force is now preparing to attack the Mothership. You shouldn't expect any support. Once you're on the ground, carry out the operation with infantry units only."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Crash the Giant Ship...Again!"},
            {
              "type": "string",
              "value": "The Mothership has arrived above the city and is dropping countless aliens. The surrounding area has been fully taken over.\n\nThis operation will now begin. Ground units, clean up any aliens and monsters. Take back that city."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Mother's Domain"},
            {
              "type": "string",
              "value": "The Mother Monster has invaded the city. Countless eggs have been spotted in the area. It seems the monster is adapting to Earth's environment and growing ever more fertile. It's only a matter of time until this area is covered in beasts. Move to eliminate them at once."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Secret of the Hot Springs"},
            {
              "type": "string",
              "value": "A group of aliens has been detected occupying a famous mountainous hot spring resort known for its curative waters. It seems they've fortified the town and are using it as their base. Strangely enough, the aliens have grown tired, and their equipment is sparse. We don't know what their goal is, but we can't just leave them be. Soldiers from the area will lead the way. Enter into the town via a mountain detour, then wipe those aliens out."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Winged Army"},
            {
              "type": "string",
              "value": "We have the upper hand in urban combat against the aliens. The battle still rages on, but we believe it's only a matter of time until we're victorious. Enter the fray once you arrive on the battleground."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Tower by the Shore"},
            {
              "type": "string",
              "value": "The new ships that were moving along the sea have changed direction. We believe they want to drop Anchors once they're over land. They're going to focus these drops in single locations, using large groups of monsters to build defended transportation sites. We have to destroy those Anchors before they can send too many monsters."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Crumbling Town"},
            {
              "type": "string",
              "value": "The massive Primer offensive has begun. The EDF is already on the verge of destruction...but we have to keep fighting. For the sake of humanity, and for the sake of this entire planet. The Primer will approach gathering spots and conduct ambushes. Make it through the city and get to the objective.\n\nWe have information that the enemy has introduced a new type of monster. Make sure to stay sharp while you move."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Final Resistance"},
            {
              "type": "string",
              "value": "The attack unit is nearly finished. Only Storm Team managed to make it to the strategic point. There's no way we can carry out an operation now... I'm sorry, but it seems that this is where our resistance ends."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Blazing Flames"},
            {
              "type": "string",
              "value": "Enemies approaching the operation point! It's a huge army!\n\nHow can this be...? Every single enemy is converging on this location."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Base 251 ††††††"},
            {
              "type": "string",
              "value": "Request for reinforcements from Base 251. Head in their direction immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Standard Mission I"},
            {
              "type": "string",
              "value": "We're cracking down on some enemy invaders. We're keeping the town safe, because that's our job."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Unchanging Days I"},
            {
              "type": "string",
              "value": "Good news, you've got a mission. You'll be taking care of some monster eggs. It may be hard labor, but it's an important job. So long as you're alive, we're putting you to work once more."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Visitors I"},
            {
              "type": "string",
              "value": "Looks like we've got invaders. It's time to crack down on them. You'll be patrolling the town while you're at it. I don't care how many times you've done this before, though. Don't get sloppy."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Next Day I"},
            {
              "type": "string",
              "value": "You'd better stay sharp. We're the only ones defending this town. I don't care what happens...we're surviving this."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "World Gone Mad"},
            {
              "type": "string",
              "value": "We can't just abandon them. We're going to rescue the corporal.\n\nIt's dangerous there on the surface. Find the corporal, then pull back immediately. Don't get distracted by food."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Banquet of the Gods"},
            {
              "type": "string",
              "value": "They're coming. We should hide here.\n\n...\n\nOur allies have been scattered, but I'm sure they're still alive. If we don't go to rescue them, then...\n\nWe need to do some recon. You wait here."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Tunnel #1"},
            {
              "type": "string",
              "value": "We're recreating that accident, which means we need to be in the same place at the same time. We're heading right under the Ring.\n\nThe surface is treacherous, though. We'll approach the Ring via underground passages. Our investigations show that the tunnels are linked to holes dug by the monsters. We should be able to come up near the Ring if we make use of those."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Big Day ††††††"},
            {
              "type": "string",
              "value": "To all survivors. We are attacking the Ring today. Those who can fight, please join our operation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Turning Point I"},
            {
              "type": "string",
              "value": "Congratulations on making it in.\n\nFive months have already passed since the aliens first appeared. Though we've put up a good fight, we've been forced into a difficult situation now. So long as we don't have a way to destroy that massive disc, we just have to find a way to survive.\n\nThis giant saucer keeps sending monsters down like they own the place, and we just keep getting whittled down. It's only a matter of time before our forces are exhausted at this rate. That said, all we can do is exterminate them. If only we had a way to shatter that disc..."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Extermination I"},
            {
              "type": "string",
              "value": "Monsters have appeared in the city. This is a sudden attack, and the civilians have yet to be fully evacuated. Get over there at once to assist the extermination teams. The giant saucer hasn't been spotted, so we don't know how these monsters got there. Be on high alert."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Aranea's Mountain"},
            {
              "type": "string",
              "value": "We've detected a thread-spitting monster that we have named Aranea. Though similar to the Betas, it seems capable of spreading its threads into a net to capture prey.\n\nAranea have attacked a mountain village, and the lives of many residents who were late to evacuate have been lost. We've also lost contact with the team sent to eradicate them. Head there at once."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Treacherous Summit"},
            {
              "type": "string",
              "value": "Monster hordes have been spotted in the mountains. Please dispatch a strike team at once. I'm going to stay here to observe."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Grenade Demolitions Unit"},
            {
              "type": "string",
              "value": "The presence of a large Grenadier unit has been confirmed. Though they're located in an evacuated area, they're only a few kilometers away from the city. They need to be stopped here.\n\nThe plan is to destroy their grenades using long-range rifle fire. Rendezvous with the sniper team and provide assistance."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Demons Descend"},
            {
              "type": "string",
              "value": "The information we're receiving is starting to get complicated. It seems that strange aliens have appeared from the enemy dropships.\n\nThe battlefield is reportedly in chaos. Head to the indicated location at once to take part in the battle."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Artillery Charge"},
            {
              "type": "string",
              "value": "The presence of aliens with long-range guns has been confirmed. Outpost 267 has been destroyed by shelling. Damage is starting to spread inside the city as well. The enemy is using howitzers with ranges of over 30 kilometers capable of highly precise targeting. Given these characteristics, we've decided that close-range combat using infantry would be the best course of attack. It's a dangerous mission, but you need to approach the enemy unit while avoiding fire. Destroy them with a close-range strike."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Death Race I"},
            {
              "type": "string",
              "value": "A new type of enemy spacecraft has appeared above the city. Ground units, prepare for Androids to be dropped. Two infantry teams, Delta and Charlie, are already on the move. If there's an emergency, rendezvous with the other teams and adapt to the situation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {
              "type": "string",
              "value": "Unstoppable Force vs. Immovable Object"
            },
            {
              "type": "string",
              "value": "Type 3 Drones have entered the city, but... For whatever reason, they've landed on homes and in the streets. They don't appear to be broken, but this has never happened before...\n\nAccompany the unit and destroy the drones. Even if they aren't moving now, they should activate and fight back if they're jostled. Make sure you're well-equipped."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Dropping Anchor"},
            {
              "type": "string",
              "value": "Teleportation Ships are gathering by the shore. The enemy ships have stopped at low altitude. It's almost like they're resting. The shore is turning into an enemy harbor, with seven ships already confirmed. Barely any escort weapons have been spotted, considering the number of enemy ships. This looks like the perfect opportunity for a surprise attack. Infantry should be able to approach the enemy without being spotted. Go with a small unit, you don't want to attract their attention. Charge under the enemy ships and take them down. Additional units will be sent after your first attack succeeds. The plan is to take every one of these enemy ships down."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The One-Eyed Giant"},
            {
              "type": "string",
              "value": "An Android unit has invaded and fully taken over the city. Its people are in danger. Any teams available for combat, head to the indicated location at once."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {
              "type": "string",
              "value": "Investigate the Massive Cave: Top Floor"
            },
            {
              "type": "string",
              "value": "We've now confirmed that the giant cave discovered three months ago is a monster nest. We've also received reports of multiple enemy Android sightings in the area. We believe the Primer are interfering with the nesting hole in order to carry out some sort of plan. We need to gather information. Form an investigatory team at once. We'll be conducting a mission to infiltrate this den."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {
              "type": "string",
              "value": "Investigate the Massive Cave: Middle Floor"
            },
            {
              "type": "string",
              "value": "Where did the captain go? How could they get lost in a place like this? What a pain.\n\nWe can't abandon them, though. Find them."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {
              "type": "string",
              "value": "Investigate the Massive Cave: Bottom Floor"
            },
            {
              "type": "string",
              "value": "We're heading to the bottom floor.\n\nWe took care of the monsters in the middle floor. The bottom should be an empty husk by now. Have some fun spelunking."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Bluebird of Terror"},
            {
              "type": "string",
              "value": "We're attacking the Kaiju that flew out of the cave.\n\nThe air force is currently pursuing the monster and has chased it into the mountains. Anti-air Keplers and many combat vehicles have been placed in the valleys. The plan is to wait for it to come to us. Accompany the unit and head on-site."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Multi-Layered Wall"},
            {
              "type": "string",
              "value": "Enemy ships have dropped Anchors. They're trying to create sites for teleportation by dropping multiple Anchors in single locations. What's more, %dq%Shield Bearers,%dq% or devices that create energy-blocking walls, now defend the Anchors.\n\nThe walls of light created by these Shield Bearers block our attacks, letting only enemy attacks through. Large-scale combat is pointless against these Shield Bearers that can nullify any form of attack. We'll need to approach them in small teams, pierce through their walls of light, and destroy the Shield Bearers. It's a dangerous mission...but we need you to accompany the elite Wing Divers there."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Collision on the Plains"},
            {
              "type": "string",
              "value": "Aliens have been dropped in locations all around the world. It seems that our enemy has started their big push. Countless aliens are closing in on our position too. We can't let them get near the city. We're deploying our heavy Titan tanks to build a defensive line.\n\nWe're facing the largest enemy army yet. This is likely to be a fierce battle, but we have an ace up our sleeve. Our brand-new weapon, the self-propelled railgun, is on its way here. Just hold the line until it arrives."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Rear Guard"},
            {
              "type": "string",
              "value": "Our defensive line has broken. We've lost.\n\nThe heavy tanks will hold our enemies back. Hurry and retreat!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Enemies Behind"},
            {
              "type": "string",
              "value": "We've managed to pull back, but our unit's been scattered. We've established a route of retreat in order to avoid any danger. Take it and head toward the rendezvous point.\n\nYou'll need to start out by heading to the mountains ahead of you."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Descending Hostiles"},
            {
              "type": "string",
              "value": "A Mothership will be passing over the city. This Mothership #2 drops combat robots, and we expect it to do the same in this area.\n\nInfantry units, spread out across the city. Assemble wherever these new robots are spotted."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Demon City"},
            {
              "type": "string",
              "value": "Dammit! The Kruul force is far bigger than what we were told. There's no way we could beat them in a proper fight. We'll have to hide in the alleys. Approach them as you take cover amongst the buildings."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Shadows of Giants"},
            {
              "type": "string",
              "value": "It seems that monsters are gathering in the mountains by the sea. We're seeing multiple massive figures on satellite imagery. We think they're likely some sort of giant monsters, like Mothers and Kings.\n\nThese monsters are going to do unfathomable amounts of damage if they make it into town. I know we don't have a proper force to fight them with...but we still need to take them out."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Machine Stronghold"},
            {
              "type": "string",
              "value": "Multiple new Anchors have been dropped into the city. The enemy seems to want to focus lots of Anchors into single locations in order to create a teleportation base.\n\nThe Teleportation Device is already online, and countless Androids have been spotted in the area. The enemy's numbers are just going to grow until the area is wiped out unless we destroy those Anchors. Any combat-ready units, please head to the operational point immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Alien Knights"},
            {
              "type": "string",
              "value": "Alien infantry units are attacking the city. Move in with the Powered Exoskeleton team and destroy the enemy units."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Operation Lead Wall"},
            {
              "type": "string",
              "value": "Aliens are now approaching, and they're a pretty big unit. We should avoid engaging them head-on...but the city has been slow to evacuate. If we don't hold them back here, we expect severe casualties. We'll act as the wall they need to stop these invaders. It's our only option.\n\nThis operation will be known as Leadwall. Deploy into the already-evacuated area, build a defensive line there, and meet the alien infantry unit."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Follow That Fortress"},
            {
              "type": "string",
              "value": "The walking fortress continues its advance. It has already trampled and destroyed countless neighborhoods. It's only a matter of time now until this entire area is turned into ruins.\n\nThe air force strike has failed. They couldn't pierce the fortress's armor. We hope that a surface-based attack will work...but the unit defending the fortress has grown, making it difficult to approach now.\n\nThat said... We still have to do this. We'll use our few remaining forces to attack the walking fortress. Your first target will be to eliminate the defensive unit.\n\nWe're going to be the civilians' shield because that is our duty."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Crumbling Town I"},
            {
              "type": "string",
              "value": "We've successfully eliminated a part of the defensive unit. Continue the operation and keep on following the walking fortress."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Approaching the Fortress"},
            {
              "type": "string",
              "value": "Even our railguns weren't able to pierce the walking fortress's armor. Our only hope now is to have a ground unit attack it from below. We believe that it's unable to defend its teleportation device, just like a Teleportation Ship. If you can just make it to a spot directly under the walking fortress and take aim at the device from there...\n\nEach team needs to break through the defensive network on their own route as they approach the walking fortress."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Base 251 †††††††"},
            {
              "type": "string",
              "value": "Request for reinforcements from Base 251. Head in their direction immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Standard Mission II"},
            {
              "type": "string",
              "value": "We're cracking down on some enemy invaders. We're keeping the town safe, because that's our job."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Visitors II"},
            {
              "type": "string",
              "value": "Looks like we've got invaders. It's time to crack down on them. You'll be patrolling the town while you're at it. I don't care how many times you've done this before, though. Don't get sloppy."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Next Day II"},
            {
              "type": "string",
              "value": "You'd better stay sharp. We're the only ones defending this town. I don't care what happens...we're surviving this."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "World Gone Mad I"},
            {
              "type": "string",
              "value": "We can't just abandon them. We're going to rescue the corporal.\n\nIt's dangerous there on the surface. Find the corporal, then pull back immediately. Don't get distracted by food."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Banquet of the Water God"},
            {
              "type": "string",
              "value": "Don't give up. Just run. There has to be a safe location, I'm sure of it.\n\nListen to me closely. You need to fear that poison mist that the Fishmen emit most of all. If you do encounter one, get as much distance from it as you can."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Tunnel #2"},
            {
              "type": "string",
              "value": "We're recreating that accident, which means we need to be in the same place at the same time. We're heading right under the Ring.\n\nThe surface is treacherous, though. We'll approach the Ring via underground passages. Our investigations show that the tunnels are linked to holes dug by the monsters. We should be able to come up near the Ring if we just make use of those."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Big Day †††††††"},
            {
              "type": "string",
              "value": "To all survivors. We are attacking the Ring today. Those who can fight, please join our operation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Shattered Serenity"},
            {
              "type": "string",
              "value": "We're heading to the town just past here. You should be able to catch your breath once we get there. Reinforcements should be arriving soon as well, and this situation should be resolved once that happens.\n\nDon't worry. I know you'll be able to make it home."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Unidentified Flying Object"},
            {"type": "string", "value": "What the hell is that thing?!"}
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Monsters Attack"},
            {
              "type": "string",
              "value": "We've made it to town. You can finally take a break now. Don't worry, this place should be safe.\n\nYou've managed to survive. I know you'll be able to make it ho...#&!(&@\n$(!&#(!)@!*%#$?\n#>~$#@(!&#@E!\n\nThis is the Professor. I was being too cautious. Forget worrying about causing a time paradox. There's no need to repeat history. Go out there and make a new one."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Spreading Calamity"},
            {
              "type": "string",
              "value": "The giant saucer has entered into the city and appears to be dropping monsters.\n\nDammit! They're just having their way with us!\n\nIt doesn't even matter if a saucer's up there or not now. Let's attack those monsters! Thinning their numbers will mean saving civilian lives. Don't forget that. %)!&@!)#&!)>\n\nIt's fine. Do whatever you feel like doing."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Death Race II"},
            {
              "type": "string",
              "value": "A new type of enemy spacecraft has appeared above the city. Ground units, prepare for Androids to be dropped. Two infantry teams, Delta and Charlie, are already on the move. If there's an emergency, rendezvous with the other teams and adapt to the situation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Conqueror"},
            {
              "type": "string",
              "value": "The enemy ship has dropped a new type of robot. \n\nThe robots have invaded the city and are indiscriminately attacking civilians. The town is in chaos. You have to hurry."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Coast Cleanup Plan"},
            {
              "type": "string",
              "value": "A pack of monsters has been spotted by the coast. Head there to exterminate them.\n\nYour unit will have three AFVs at its disposal. You should have enough firepower, but still...be careful out there."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Sudden Shock"},
            {
              "type": "string",
              "value": "A Mothership is heading to the city. We believe it will drop Anchors from a high altitude.\n\nThis is an urgent matter. Any nearby units, head to the scene immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Swarm Surfaces"},
            {
              "type": "string",
              "value": "One monster after the next is appearing from the sea. They seem to be moving inland after surfacing, but it's hard to figure out exactly what's happening... There's a thick fog around the entire area.\n\nPlease head to the nearby town."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Observe the Fleet"},
            {
              "type": "string",
              "value": "The new enemy fleet has stopped its movements above the city. We believe they're preparing for an attack. Head to where they are and rendezvous with the recon team. Continue observing the enemy ships until the attack unit arrives."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Giant Sleeping Bird"},
            {
              "type": "string",
              "value": "Siren has stopped moving. We believe it's in a state of dormancy. This is our chance to execute our plan to destroy the Siren.\n\nExplosives team has made their approach and will be placing high-pressure evaporation charges. Attack team, rid the area of any hostiles to make sure that the explosives team stays safe."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Advance of the Machine Army"},
            {
              "type": "string",
              "value": "The enemy Android army is invading town. These Androids are protected by a drone unit.\n\nWe've sent tanks in, but they won't make it in time. The civilians have yet to be fully evacuated, and we'll suffer major casualties if we don't act. Any nearby units, head to their location at once. Hold the Androids back until the tank team arrives."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Ambush"},
            {
              "type": "string",
              "value": "A new tactic has been proposed. The Strategic Information Division has predicted the enemy fleet's course, and we'll wait along it to ambush them.\n\nAccording to these predictions, they'll be flying low over the mountains in order to evade radar detection. It seems they're attempting to invade the city.\n\nAttack unit, hide yourselves at the designated point and wait for an opportunity to attack.\n\n...I'm not sure why we've been able to predict the enemy's movements, but if the Strategic Intelligence Division is right, they'll have the ability to turn this situation around. We pray for your success."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Operation Bird-Buster"},
            {
              "type": "string",
              "value": "Siren has stopped above the city and seems to have entered another state of dormancy.\n\nNow that this monstrous bird has fallen asleep, it's our chance to execute the plan. Multiple EMCs will be sent in, and we'll destroy Siren with a coordinated attack.\n\nUp in orbit, the Buster is preparing to fire. There can't possibly be any living creature able to stand up to a direct hit from our high-output laser cannon."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Collision on the Plains I"},
            {
              "type": "string",
              "value": "Aliens have been dropped in locations all around the world. It seems that our enemy has started their big push. Countless aliens are closing in on our position too. We can't let them get near the city. We're deploying our heavy Titan tanks to build a defensive line.\n\nWe're facing the largest enemy army yet. This is likely to be a fierce battle, but we have an ace up our sleeve. Our brand-new weapon, the self-propelled railgun, is on its way here. Just hold the line until it arrives."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Lured by the Shadow Fish"},
            {
              "type": "string",
              "value": "Glaukos has been moving across the sea and has now passed the shore. It's possible that Scylla will descend on Glaukos's landing point. The chances are low, but we need to be careful.\n\nA unit will be placed in the coastal area, ready for Scylla to appear. Tanks have already been sent in, and the railgun unit should make a delayed arrival as well. Wait by the shore, and if you spot any Scylla, stop them from making a landing."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Burning Wharf"},
            {
              "type": "string",
              "value": "A Teleportation Ship has gone into the mountains...and stopped. We believe it's conducting recon in order to build a teleportation site.\n\nWe need to make our move before the enemy can act. A small unit should be able to destroy a single ship.\n\nBravo Team is waiting on-site. Rendezvous with Alpha and head there. Fencers will also be joining this operation later."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Attack the Fleet"},
            {
              "type": "string",
              "value": "A fleet of Teleportation Ships has entered the industrial area. They appear to have gone inactive after stopping at a low altitude.\n\nWe'll need to take down the fleet before they can commence their attack, but we're currently busy attacking the Kaiju. The majority of units are away from base, and so we aren't able to secure a proper fighting force. That's why we'll need to execute a night raid with only a small number of units. Approach them under cover of darkness, then launch a surprise attack to destroy those Teleportation Ships."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Incandescent Zone"},
            {
              "type": "string",
              "value": "The city has been taken over by Excavators. We've suffered many civilian casualties, and any survivors have evacuated.\n\nWe have to destroy those Excavators before they start back up again. Head to their location now."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Armored Mountains"},
            {
              "type": "string",
              "value": "We see signs of enemies in the mountains ahead. They appear to be Teleportation Anchors."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Exterminate the Monsters"},
            {
              "type": "string",
              "value": "A large group of monsters has been spotted. We have to destroy them before they can do any more damage. An extermination unit has been dispatched to their location, as have AFVs. After rendezvousing with the extermination unit, provide support to the AFVs while wiping these monsters out."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Defend the Sub Carrier"},
            {
              "type": "string",
              "value": "Sub Carrier Pandora has been attacked by Scylla. The damage has forced it to urgently surface. It's now stationed by the shore so that it can be defended by land-based forces. A guard team has been assembled to keep Pandora safe and is already on its way. Rendezvous with them as a reinforcing unit and provide aid to Pandora."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Operation Bird-Buster II"},
            {
              "type": "string",
              "value": "Glaukos has stopped moving. It seems that it still needs to rest even after its body has started burning.\n\nWhile there is only one Glaukos, it's a terrifying creature, with enough power to destroy all of civilization. If we don't stop it now...humanity has no future. It's time to use the ace up our sleeve: the Chiren Charges loaded onto the sub carrier Pandora. No living creature should be able to survive them.\n\nThe EMC unit is headed this way as well. The plan is to weakening Glaukos with an all-out EMC attack, then finish it off with the Chiren Charges.\n\nAn EMC has been prepared for you on orders from headquarters. It's a special unit with enhanced mobility. Board the blue EMC and take part in the operation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Diversionary Tactics"},
            {
              "type": "string",
              "value": "A top-secret operation has been put into action. This is a strategy to go after the opponent's neck. It's sure to land a fatal blow...but as a surprise attack, it'll all be over if the enemy learns of it.\n\nA simultaneous attack will be launched around the world in order to distract the enemy. You'll be attacking the teleportation site in this area. Take back the town.\n\nWe'll need to simultaneously attack as many locations as possible. This will split our forces, and each location will be short on firepower. It won't be an easy battle...but humanity's survival is riding on it. Best of luck."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Base 251 ††††††††"},
            {
              "type": "string",
              "value": "Request for reinforcements from Base 251. Head in their direction immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Tactical Aircraft Operation"},
            {
              "type": "string",
              "value": "We're going to destroy the aliens that have been dropped into the city. The area of operations will be split into three points, A, B, and C, for the purpose of easier coordination with the air force.\n\nStart by heading to point A. Air strikes will be conducted at each point as is appropriate."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Aliens Attack"},
            {
              "type": "string",
              "value": "The enemy army has begun their invasion. We'll fight them back in the operational area.\n\n?!\n\nA new type of ship has been spotted to their rear. It seems they plan on dropping in additional forces.\n\nThis attack may be an even larger invasion than was first predicted. Requesting additional assistance at once."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Visitors III"},
            {
              "type": "string",
              "value": "Aliens have invaded the city. Please accompany the sergeant there and help eliminate them.\n\n...The sergeant is famously hot-tempered. Please keep him safe so that he doesn't throw his life away."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Next Day III"},
            {
              "type": "string",
              "value": "You'd better stay sharp. We're the only ones defending this town. I don't care what happens...we're surviving this."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "World Gone Mad II"},
            {
              "type": "string",
              "value": "We can't just abandon them. We're going to rescue the corporal.\n\nIt's dangerous there on the surface. Find the corporal, then pull back immediately. Don't get distracted by food."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Banquet of the Wind God"},
            {
              "type": "string",
              "value": "They're coming. We should hide here.\n\n...\n\nOur allies have been scattered, but I'm sure they're still alive. If we don't go to rescue them, then...\n\nWe need to do some recon. You wait here."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Tunnel #3"},
            {
              "type": "string",
              "value": "We're recreating that accident, which means we need to be in the same place at the same time. We're heading right under the Ring.\n\nThe surface is treacherous, though. We'll approach the Ring via underground passages. Our investigations show that the tunnels are linked to holes dug by the monsters. We should be able to come up near the Ring if we just make use of those."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Big Day ††††††††"},
            {
              "type": "string",
              "value": "To all survivors. We are attacking the Ring today. Those who can fight, please join our operation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Today's Plans"},
            {
              "type": "string",
              "value": "Today you'll be at EDF Garrison #228. Once you arrive, follow the staff's orders and confirm your plan of action. A tour of the base is planned in the afternoon. The EDF has worked to build relations with neighboring residents, and so we expect a large crowd today. Be sure to keep their safety in mind."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Base 228 in Peril"},
            {
              "type": "string",
              "value": "Good news for the civilians. They just need to get the surface and they'll be okay.\n\nAs for us, we need to rendezvous with the unit and handle the situation. This is where we say goodbye.\n\n...Or so I'd like to say, but don't worry. We'll get you home safe first."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Operation Annihilation"},
            {
              "type": "string",
              "value": "Monsters have appeared in the city. Go out there and wipe them out alongside the extermination team.\n\nLarge-scale attacks against the Kaiju are also being carried out in the area, which means we won't be able to provide you adequate support. We're expecting great things from the extermination team."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Survey the Giant Cave"},
            {
              "type": "string",
              "value": "A giant cave has been discovered. It could be an opening to a nest of monsters.\n\nThe unit that discovered it has entered inside to survey the area. Rendezvous with them on-site and take part in the investigation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Death Race III"},
            {
              "type": "string",
              "value": "A new type of enemy spacecraft has appeared above the city. Ground units, prepare for Androids to be dropped. Two infantry teams, Delta and Charlie, are already on the move. If there's an emergency, rendezvous with the other teams and adapt to the situation."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Block the Transmission"},
            {
              "type": "string",
              "value": "An enemy fleet is now gathering above the city. We believe they want to place down some Anchors.\n\nForm an attack unit at once. Hide amongst the buildings as you approach the fleet while eliminating any ground-based enemy forces. Your highest-priority target should be the Anchors, followed by the aliens. There's no need to attack the enemy fleet."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Bogey Raid"},
            {
              "type": "string",
              "value": "Enemy drone unit has arrived. There are three drone units, one for each type, and they're flying through the city.\n\nWe'll have to stop their invasion, or else the entire area will be razed. Wait on the streets and take down each unit one by one.\n\nA KG6 Kepler is there on the ground for you. Board it."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Destroy the Giant Cave"},
            {
              "type": "string",
              "value": "Our investigation of the cave we found earlier has concluded. We should be able to make it there safely now.\n\nEnter inside the cave once more. This time, we're destroying that giant nest.\n\nAttack Team 1, approach from the front of the nest. Attack Team 2, follow behind them. Attack Team 3 will be placed at the nest's rear passage."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Incubation"},
            {
              "type": "string",
              "value": "A flying creature has been detected in the mountainous area. Please go there to investigate."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Sleeping Fleet"},
            {
              "type": "string",
              "value": "Look, it's an enemy fleet.\n\nThey're not moving. It's like they're hiding in these mountains, waiting for their next attack. This is our only chance. Get right under them and take them down.\n\nOur numbers may not be large, but this is a mission worth doing. Let's go. The enemy is vulnerable, so it's time to bloody their nose."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Pouring Into Town"},
            {
              "type": "string",
              "value": "They've broken through our defensive line. The pack of enemy monsters is even larger than expected.\n\nWe're going to suffer major losses if we don't do something. Nearby teams, move to the specified point in the city and wait for the monsters there.\n\nI imagine this will be a fierce battle. Still... You have to keep the civilians safe."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Assembly Point"},
            {
              "type": "string",
              "value": "Aliens have started to gather in the city. Alpha Team is currently engaging them. Bravo, head over to provide support."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Mountain Stronghold"},
            {
              "type": "string",
              "value": "Enemy ships have been detected. They seem to be headed to the mountains in the outskirts, likely to build a teleportation site. We have to stop them before they start making full use of their teleporters. Any nearby units, head over there."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Artillery Exchange"},
            {
              "type": "string",
              "value": "An alien artillery unit is on the march, and they've got grenadiers behind them. They're headed for the city, and I imagine it'll be blown to bits if this unit gets to attack. We have to find a way to stop them... There's no time for fooling around, we'll meet them head-on with AFVs.\n\nWe expect there to be intense shelling in this battle. Come prepared with the right equipment."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Special Vehicle Unit"},
            {
              "type": "string",
              "value": "A Mothership has arrived from an unexpected direction. It's not like the Motherships we've seen so far. This must be...the eleventh one.\n\nIt's now dropping combat robots into the city. They've taken us by surprise, so not many soldiers are in the area. It's a difficult situation, but we need you to hurry there at once. Destroy those combat robots."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "A Reckless Gamble"},
            {
              "type": "string",
              "value": "Mothership #11 may be the enemy's flagship. Taking it down will likely change the tides of this entire war.\n\nUnfortunately, our forces are thin in this area. We've requested aid, but I doubt it'll arrive in time. Still, it's a battle worth fighting. Even if a sacrifice is involved, a victory here would mean...\n\nInfantry unit, approach #11. Eliminate any ground-based units guarding it."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Ship #11"},
            {
              "type": "string",
              "value": "Mothership #11 has paused once more. It seems to have rendezvoused with a new defensive unit, but assistance has arrived for us as well. We even have air force support, and diversionary tactics are being carried out in multiple locations in order to isolate #11.\n\nThis is a turning point in the war, the most important operation we've carried out yet. We're throwing everything we can into attacking Mothership #11.\n\n...I suppose that the Mothership not running means that it has a formidable offense. There's no guarantee that we'll win this. Still, don't forget that we're on the front lines of a battle with humanity's survival on the line."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Base 251 †††††††††"},
            {
              "type": "string",
              "value": "Request for reinforcements from Base 251. Head in their direction immediately."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Webbed Castle"},
            {
              "type": "string",
              "value": "Aranea have invaded a residential area where many survivors now live. You need to head there at once."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Aliens Attack I"},
            {
              "type": "string",
              "value": "The enemy army has begun their invasion. We'll fight them back here.\n\n!!!\n\nA dropship has been spotted to their rear. It seems they plan on dropping in additional forces.\n\nThis attack may be an even larger invasion than was first predicted. We'll be deploying our new unit to annihilate the enemy."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Giant God Comes Crashing"},
            {
              "type": "string",
              "value": "The Kaiju army is approaching. We believe this to be quite a large-scale attack. The Primer may want to end things in this area here.\n\nThe enemy's tactics are simple and clear. Brute force. We'll fight back with the same."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Visitors IIII"},
            {
              "type": "string",
              "value": "Aliens have invaded the city. Please accompany the sergeant there and help eliminate them.\n\n...The sergeant is famously hot-tempered. Please keep him safe so that he doesn't throw his life away."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Unchanging Days II"},
            {
              "type": "string",
              "value": "Good news, you've got a mission. You'll be taking care of some monster eggs. It may be hard labor, but it's an important job. So long as you're alive, we're putting you to work once more."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Maximum Power"},
            {
              "type": "string",
              "value": "Monsters have been spotted! Large ones! \nI repeat, we've got large ones!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Invasion of the Mechanical Soldiers"},
            {
              "type": "string",
              "value": "The Android army continues to advance. Our plan to stop them has failed, and our defensive lines have crumbled.\n\nThe enemy army will reach this area soon. While we're lacking in forces, we still have to put up a fight. Countless civilians are still there behind us. We'll use the lay of the land to slow the Androids down."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Treacherous Summit I"},
            {
              "type": "string",
              "value": "Monster hordes have been spotted in the mountains. Please dispatch a strike team at once. I'm going to stay here to observe."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Town of Darkness"},
            {
              "type": "string",
              "value": "Multiple Teleportation Anchors have been dropped into the city, and monsters continue to pour out of them. The area has now turned into an enemy teleportation site and cannot be easily approached.\n\nWhile retaking the town won't be easy, it may be possible at night, when their movements dull. Power to the operational area has been cut off. We'll cover the town in darkness and starve them of vision. This will obviously keep us from being able to see as well, but our chances should still be better than if we went with a daytime attack.\n\nWe've gathered a Wing Diver team. They're used to nighttime raids, so head there with them."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Pursuer"},
            {
              "type": "string",
              "value": "We're now pursuing the Android unit.\n\n...We seem to have caught up to them. Now commencing attack.\n\nSo they retreated into disadvantageous territory? Okay, you damned Androids! This will be your grave!"
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Next Day IIII"},
            {
              "type": "string",
              "value": "A new type of enemy ship has started to teleport the Kaiju known as Erginus. This massive monster must be their trump card. I can't stand these damned invaders. Time to show them who's boss."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Operation Ring-Cracker: Part 1"},
            {
              "type": "string",
              "value": "Their attempts to alter history have failed, but I'm sure they'll try to regroup and do it again. We have to destroy the Ring here.\n\nWe know the Ring's weakness. Taking one down is simple if we can just send an attack unit right below it. But it seems they've finally figured that out as well... They've increased the number of units guarding the Ring.\n\nWe'll move in via three routes in order to break through their defenses, forcing our way in from all three points at the same time. If even one of our units can make it, we've won. You accompany the route 1 team.\n\nWe don't have a way to turn back time now. This is where our journey ends."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "Operation Ring-Cracker: Part 2"},
            {
              "type": "string",
              "value": "Routes 2 and 3 have been annihilated. Only the route 1 team made it.\n\nFortunately...you're with them. You're a pro when it comes to this operation. Go and destroy its weakness, the control unit, from below. Do that and this will all come to an end."
            }
          ]
        },
        {
          "type": "ptr",
          "value": [
            {"type": "string", "value": "The Scales of Time"},
            {
              "type": "string",
              "value": "A colossal ship has appeared! It showed up in the sky out of nowhere.\n\nThis thing is as massive as the Ring, but it moves at a terrifying speed.\n\nThe enemy should be experiencing errors with their time travel now that the Ring has been destroyed...but if that thing has managed to appear here at this very moment, it must have capabilities equivalent to the Ring, or possibly even greater. That is all we can possibly conclude. In other words...that thing is their second time traveling mothership."
            }
          ]
        }
      ]
    }
  ]
}